projectTemplate - Copy old/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE).*"
    {
        //solver          PCG;//smoothSolver;
		//solver			PCG;
		//preconditioner	GAMGPreconditioner; //diagonal;
		//tolerance       1e-10;
        //relTol          0;
		solver			diagonal;
    }

    "U.*"
    {
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         5;
        //tolerance       1e-10;
        //relTol          0.001;
		solver			PCG;
		preconditioner	GAMGPreconditioner; //diagonal;
		tolerance       1e-10;
        relTol          0;
    }

    "e.*"
    {
        //$U;
		solver			PCG;
		preconditioner	GAMGPreconditioner; //diagonal;
		tolerance       1e-10;
        relTol          0;
		
    }
}

PIMPLE
{
    nOuterCorrectors 2;
}


// ************************************************************************* //
